export interface IAbout {
  id: number;
  title: string;
  text: IText[];
  color: string;
}

interface IText {
  innerText: string;
}

export const aboutArray = [
  {
    id: 0,
    title: "전공을 전향한 사유",
    text: [
      {
        innerText:
          "패션디자인과를 나와 관련 업계에서 근무를 하면서 자주 접하는 것 중에 하나는 패션 웹사이트입니다. ",
      },
      {
        innerText:
          "웹사이트를 관찰하고 이용하면서 제작 과정이 궁금해졌습니다. 그 후 학원에 접수하여 퍼블리셔/프론트엔드 교육을 이수했습니다. 배우면서 느낀 점은 생각보다 쉽지 않고, 생각보다 재미있다는 점입니다. 배우면 배울수록 더 깊게 알고 싶어졌습니다. 저는 새로운 것을 배우는 걸 좋아하는 편입니다. 시도하고 문제가 생기면 해결하는 방식이 개발자와 유사한 부분이 있다고 생각합니다.",
      },
      {
        innerText:
          "따라서 현재는 패션디자인을 나와 코드를 짜면서 코드를 디자인하는 사람이 되고 싶습니다. ",
      },
    ],
    color: "#F5EFE6",
  },
  {
    id: 1,
    title: "비전공자가 전공자를 이길 수 없나?",
    text: [
      {
        innerText:
          "패션디자인과를 나와 관련 업계에서 근무를 하면서 자주 접하는 것 중에 하나는 패션 웹사이트입니다. ",
      },
      {
        innerText:
          "웹사이트를 관찰하고 이용하면서 제작 과정이 궁금해졌습니다. 그 후 학원에 접수하여 퍼블리셔/프론트엔드 교육을 이수했습니다. 배우면서 느낀 점은 생각보다 쉽지 않고, 생각보다 재미있다는 점입니다. 배우면 배울수록 더 깊게 알고 싶어졌습니다. 저는 새로운 것을 배우는 걸 좋아하는 편입니다. 시도하고 문제가 생기면 해결하는 방식이 개발자와 유사한 부분이 있다고 생각합니다.",
      },
      {
        innerText:
          "따라서 현재는 패션디자인을 나와 코드를 짜면서 코드를 디자인하는 사람이 되고 싶습니다. ",
      },
    ],
    color: "#E8DFCA",
  },
  {
    id: 2,
    title: "지금까지 코딩을 하면서 느낀 점",
    text: [
      {
        innerText:
          "패션디자인과를 나와 관련 업계에서 근무를 하면서 자주 접하는 것 중에 하나는 패션 웹사이트입니다. ",
      },
      {
        innerText:
          "웹사이트를 관찰하고 이용하면서 제작 과정이 궁금해졌습니다. 그 후 학원에 접수하여 퍼블리셔/프론트엔드 교육을 이수했습니다. 배우면서 느낀 점은 생각보다 쉽지 않고, 생각보다 재미있다는 점입니다. 배우면 배울수록 더 깊게 알고 싶어졌습니다. 저는 새로운 것을 배우는 걸 좋아하는 편입니다. 시도하고 문제가 생기면 해결하는 방식이 개발자와 유사한 부분이 있다고 생각합니다.",
      },
      {
        innerText:
          "따라서 현재는 패션디자인을 나와 코드를 짜면서 코드를 디자인하는 사람이 되고 싶습니다. ",
      },
    ],
    color: "#AEBDCA",
  },
  {
    id: 3,
    title: "관심있는 분야",
    text: [
      {
        innerText:
          "패션디자인과를 나와 관련 업계에서 근무를 하면서 자주 접하는 것 중에 하나는 패션 웹사이트입니다. ",
      },
      {
        innerText:
          "웹사이트를 관찰하고 이용하면서 제작 과정이 궁금해졌습니다. 그 후 학원에 접수하여 퍼블리셔/프론트엔드 교육을 이수했습니다. 배우면서 느낀 점은 생각보다 쉽지 않고, 생각보다 재미있다는 점입니다. 배우면 배울수록 더 깊게 알고 싶어졌습니다. 저는 새로운 것을 배우는 걸 좋아하는 편입니다. 시도하고 문제가 생기면 해결하는 방식이 개발자와 유사한 부분이 있다고 생각합니다.",
      },
      {
        innerText:
          "따라서 현재는 패션디자인을 나와 코드를 짜면서 코드를 디자인하는 사람이 되고 싶습니다. ",
      },
    ],
    color: "#7895B2",
  },
];
